nebisman/UNDCMotor/code/esp32_code/src/main.cpp
    for (i = 0; i < n - 1; i++) {
        if (t[i] <= t_interp && t_interp <= t[i + 1]) {
            // Linear interpolation formula: y = y1 + (y2 - y1) * ((x - x1) / (x2 - x1))
            r1 = (float) ( t_interp -  t[i]) / (t[i + 1] - t[i]);
            result = r[i] + (r[i + 1] - r[i]) *  r1;
        }
    }
    return result;
}

void voltsToMotor( float volts){
    // This function convert a voltage value given in variable volts
    // to a bipolar pwm signal for controlling the motor

    unsigned int pwm = abs(volts)*percent2pwm;

    if (volts < 0){
        // if var volts is negative use CH_PWM_AIN2 to output a pwm signal
        // proportional to the input voltage
        ledcWrite(CH_PWM_AIN1, 0);
        ledcWrite(CH_PWM_AIN2, pwm);
    }
    else{
        // if var volts is negative use CH_PWM_AIN1 to output a pwm signal
        // proportional to the input voltage
        ledcWrite(CH_PWM_AIN1, pwm);
        ledcWrite(CH_PWM_AIN2, 0);
    }
}


void sensorToColormap(float x, uint8_t * rgbval) {
    // This function calculates the R, G, and B values of a fifth-degree polynomial approximation of the turbo colormap.
    // It is the colormap displayed by the WS2812 LEDs connected to the thermal plant.
    // The resulting colormap enables the user to visualize both the plant's temperature and the controller's actions.
    // The input 'x' represents a normalized value within the [0, 1] range, corresponding to the analog variable visualized by the LEDs.
    // The input 'rgbval' is a 3-element array designed to store the computed RGB values.

    float r;
    float g;
    float b;
    // colormap turbo
    r = 0.1357 + x * ( 4.5974 - x * ( 42.3277 - x * ( 130.5887 - x * ( 150.5666 - x * 58.1375 ))));
    g = 0.0914 + x * ( 2.1856 + x * ( 4.8052 - x * ( 14.0195 - x * ( 4.2109 + x * 2.7747 ))));
    b = 0.1067 + x * ( 12.5925 - x * ( 60.1097 - x * ( 109.0745 - x * ( 88.5066 - x * 26.8183 ))));


    r = constrain(r,0,1);
    g = constrain(g,0,1);
    b = constrain(b,0,1);

    rgbval[0] = (uint8_t) 255*r;
    rgbval[1] = (uint8_t) 255*g;
    rgbval[2] = (uint8_t) 255*b;
    rgbval[0] = pgm_read_byte(&gamma8[rgbval[0]]);
    rgbval[1] = pgm_read_byte(&gamma8[rgbval[1]]);
    rgbval[2] = pgm_read_byte(&gamma8[rgbval[2]]);
}

void displayLed(float var, float valmin, float valmax, float percent, uint8_t  led){
    // This function takes an analog variable and visualizes it as a colormap using the "sensorToColormap" function.
    // The 'var' parameter represents the analog variable, while 'valmin', 'valmax', and 'percent' serve as adjustment
    // parameters to scale the colormap.
    // The 'led' parameter, with values 0 or 1, denotes each of the LEDs attached to the plant.
    uint8_t rgb[3];
    float change;
    float x;
    float valmin_b;

    float valmax_b;
    float start = 0.025;
    change = valmax - valmin;
    valmin_b = valmin - percent * change;
    valmax_b = valmax + percent * change;
    x = start + constrain((1-start)* (var - valmin_b)/(valmax_b-valmin_b), 0, 1-start);
    sensorToColormap( x,  rgb);
    uint32_t color = dispLed.Color(rgb[0], rgb[1], rgb[2]);
    dispLed.setPixelColor(led, color );
    dispLed.show();
}

// This function suspend all  controlling tasks
void suspendAllTasks(){
    vTaskSuspend(h_publishStateTask);
    vTaskSuspend(h_generalControlTask);
    vTaskSuspend(h_controlPidTask);
    vTaskSuspend(h_identifyTask);
    vTaskSuspend(h_stepOpenTask);
    voltsToMotor(0);
}

// This function activate the default controllet
void defaultControl(){
    codeTopic = DEFAULT_TOPIC;
    encoderMotor.setCount(0);
    encoderPot.setCount(0);
    if (typeControl == PID_CONTROLLER){
        vTaskSuspend(h_generalControlTask);
        vTaskResume(h_controlPidTask);
    }
    else if (typeControl == GENERAL_CONTROLLER){
        vTaskSuspend(h_controlPidTask);
        vTaskResume(h_generalControlTask);
    }
    vTaskSuspend(h_publishStateTask);
    vTaskSuspend(h_identifyTask);
    vTaskSuspend(h_stepOpenTask);
}



// These functions handle the WiFi and mqtt communication




void connectMqtt()
{
    printf("Starting MQTT connection...");
    if (mqttClient.connect(THINGNAME, USER, PASSWORD))
    {
        mqttClient.subscribe(USER_SYS_SET_PID);
        mqttClient.subscribe(USER_SYS_SET_GENCON);
        mqttClient.subscribe(USER_SYS_SET_REF);
        mqttClient.subscribe(USER_SYS_STEP_CLOSED);
        mqttClient.subscribe(USER_SYS_STAIRS_CLOSED);
        mqttClient.subscribe(USER_SYS_PRBS_OPEN);
        mqttClient.subscribe(USER_SYS_STEP_OPEN);
        mqttClient.subscribe(USER_SYS_PROFILE_CLOSED);
        printf("now connected to broker!\n");
    }
    else
    {
        printf("Failed MQTT connection code %d \n try again in 3 seconds\n", mqttClient.state());
    }
}
void connectWiFi(){
    WiFi.disconnect(true);
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    while (WiFi.status() != WL_CONNECTED) {
        Serial.print(".");
        vTaskDelay(pdMS_TO_TICKS(250));
    }
    printf("\n");
    printf("Connected to WIFI through IP: %s \n", WiFi.localIP().toString());

}



void handleConnections(void *pvParameters) {
    for (;;) {
        if (WiFi.status() != WL_CONNECTED) {
            connectWiFi();
        }
        if (!mqttClient.connected()) {
            vTaskDelay(3000);
            connectMqtt();
        }
        mqttClient.loop();
        vTaskDelay(pdMS_TO_TICKS(500));
    }
}


void IRAM_ATTR onMqttReceived(char* lastTopic, byte* lastPayload, unsigned int lenght) {
    suspendAllTasks();
    JsonDocument doc;
    if (strstr(lastTopic, USER_SYS_SET_PID)) {
        typeControl = PID_CONTROLLER;
        deserializeJson(doc, lastPayload);
        kp = hex2Float((const char *) doc["kp"]);
        ki = hex2Float((const char *) doc["ki"]);
        kd = hex2Float((const char *) doc["kd"]);
        N = hex2Float((const char *) doc["N"]);
        reset_int = true;
        beta = hex2Float((const char *) doc["beta"]);
        printf("PID parameters settled:\n    kp=%0.3f\n    ki=%0.3f\n    kd=%0.3f\n    N=%0.3f\n    Beta=%0.3f\n",
               kp, ki, kd, N, beta);
        defaultControl();
    }
    else if(strstr(lastTopic, USER_SYS_SET_GENCON)){
        deserializeJson(doc, lastPayload);
        order = hex2Long((const char *) doc["order"]);
        const char *hex_A = doc["A"];
        const char *hex_B = doc["B"];
        const char *hex_C = doc["C"];
        const char *hex_D = doc["D"];
        const char *hex_L = doc["L"];
        hexStringToMatrix( *A, hex_A, order, order, 10 );
        hexStringToMatrix( *B, hex_B, order, 2, 2);
        hexStringToFloatArray(C, hex_C, order);
        hexStringToFloatArray(D, hex_D, 2);
        hexStringToFloatArray(L, hex_L, order);
        typeControl = GENERAL_CONTROLLER;
        reset_int = true;
        printf("A general controller or order %d has been loaded\n", order);
        printf("A=\n");
        for ( uint8_t  i =0; i < order; i++ ){
            for (size_t j =0; j < order; j++ ) {
                printf("%0.4f    ", A[i][j]);
            }
            printf("\n");
        }
        printf("B=\n");
        for (uint8_t  i =0; i < order; i++ ) {
            for (size_t j =0; j < 2; j++ ) {
                printf("%0.4f    ", B[i][j]);
            }
            printf("\n");
        }
        printf("C=\n");
        for (uint8_t  j =0; j < order; j++ ) {
            printf("%0.4f    ", C[j]);
        }
        printf("\n");
        printf("D = %0.4f   %0.4f \n", D[0], D[1]);
        printf("L=\n");
        for (uint8_t  j =0; j < order; j++ ) {
            printf("%0.4f    ", L[j]);
        }
        printf("\n");
        defaultControl();
    }

    else if (strstr(lastTopic, USER_SYS_SET_REF)) {
        //codeTopic = USER_SYS_SET_REF_INT;
        deserializeJson(doc, lastPayload);
        reference = hex2Float((const char *) doc["reference"]);
        reset_int = true;
        printf("Reference has been set to %0.2f degrees \n", reference);
        defaultControl();
    }
    else if (strstr(lastTopic, USER_SYS_STEP_CLOSED )) {
        codeTopic = USER_SYS_STEP_CLOSED_INT;
        deserializeJson(doc, lastPayload);
        low_val = hex2Float((const char *) doc["low_val"]);
        high_val = hex2Float((const char *) doc["high_val"]);
        points_high = hex2Long((const char *) doc["points_high"]);
        points_low = hex2Long((const char *) doc["points_low"]);
        total_time = points_low + points_high;
        reset_int = true;
        printf("Closed loop step response:\n");
        printf("    low value=%0.2f\n    high value=%0.2f\n    time in high =%0.2f\n    time in low=%0.2f\n", low_val,
               high_val, (float) (points_high * h), (float) (points_low * h));
        if (typeControl == PID_CONTROLLER) {
            vTaskResume(h_publishStateTask);
            vTaskResume(h_controlPidTask);
        }
        else if (typeControl == GENERAL_CONTROLLER) {
             vTaskResume(h_publishStateTask);
             vTaskResume(h_generalControlTask);
        }

