nebisman/UNDCMotor/code/esp32_code/src/main.cpp
    }
    else if (strstr(lastTopic, USER_SYS_STAIRS_CLOSED)){
        codeTopic = USER_SYS_STAIRS_CLOSED_INT;
        deserializeJson(doc, lastPayload);
        low_val = hex2Float((const char *) doc["min_val"]);
        high_val = hex2Float((const char *) doc["max_val"]);
        points_stairs = hex2Long((const char *) doc["points_stairs"]);
        duration = hex2Long((const char *) doc["duration"]);
        const char *hexSignal = doc["signal"];
        hexStringToFloatArray(stairs, hexSignal, points_stairs);
        total_time = points_stairs * duration - 1;
        reset_int = true;
        printf("Stairs signal of %d steps  with a duration of %0.2f secs.\n", points_stairs, h * total_time);
        if(typeControl == PID_CONTROLLER) {
            vTaskResume(h_publishStateTask);
            vTaskResume(h_controlPidTask);
        }
        else if (typeControl == GENERAL_CONTROLLER) {
           vTaskResume(h_publishStateTask);
           vTaskResume(h_generalControlTask);
        }
    }

    else if(strstr(lastTopic, USER_SYS_PRBS_OPEN )) {
        codeTopic = USER_SYS_PRBS_OPEN_INT;
        deserializeJson(doc, lastPayload);
        low_val  = hex2Float((const char *) doc["low_val"]);
        high_val = hex2Float((const char *) doc["high_val"]);
        divider = hex2Long((const char *) doc["divider"]);
        total_time = PRBS_LENGTH * divider;
        reset_int = true;
        printf("Open loop test with a prbs signal with %d steps with a duration of %0.2f secs.\n",
               total_time, (total_time-1) * h);
        vTaskResume(h_publishStateTask);
        vTaskResume(h_identifyTask);
    }
    else if(strstr(lastTopic, USER_SYS_STEP_OPEN )){
        codeTopic = USER_SYS_STEP_CLOSED_INT;
        deserializeJson(doc, lastPayload);
        low_val = hex2Float((const char *) doc["low_val"]);
        high_val = hex2Float((const char *) doc["high_val"]);
        points_high = hex2Long((const char *) doc["points_high"]);
        points_low = hex2Long((const char *) doc["points_low"]);
        total_time = points_low + points_high;
        reset_int = true;
        printf("Open loop step response:\n");
        printf("    low value=%0.2f\n    high value=%0.2f\n    time in high=%0.2f\n    time in low=%0.2f\n", low_val,
               high_val, (float) (points_high * h), (float) (points_low * h));
        vTaskResume(h_publishStateTask);
        vTaskResume(h_stepOpenTask);
    }

    else if(strstr(lastTopic, USER_SYS_PROFILE_CLOSED)){
        codeTopic = USER_SYS_PROFILE_CLOSED_INT;
        deserializeJson(doc, lastPayload);
        points_stairs = hex2Long((const char *) doc["points"]);
        low_val = hex2Float((const char *) doc["min_val"]);
        high_val = hex2Float((const char *) doc["max_val"]);
        const char *timeValuesHex = doc["timevalues"];
        const char *stairsHex = doc["refvalues"];
        hexStringToFloatArray(stairs, stairsHex, points_stairs);
        hexStringToLongArray(timeValues, timeValuesHex, points_stairs);
        total_time = timeValues[points_stairs - 1];
        reset_int = true;
        printf("Closed loop profile response with a duration of %0.2f secs.\n", total_time * h);
        printf("   refvalues = [ ");
        for (uint8_t  j =0; j < points_stairs; j++ ) {
            printf("%0.2f ", stairs[j]);
        }
        printf("]\n");
        printf("   timevalues = [ ");
        for (uint8_t  j =0; j < points_stairs; j++ ) {
            printf("%0.2f ", timeValues[j] * h);
        }
        printf("]\n");

        if(typeControl == PID_CONTROLLER) {
            vTaskResume(h_publishStateTask);
            vTaskResume(h_controlPidTask);
        }
        else if (typeControl == GENERAL_CONTROLLER) {
            vTaskResume(h_publishStateTask);
            vTaskResume(h_generalControlTask);
        }


    }




}


void initMqtt() {
    mqttClient.setServer(BROKER, 1883);
    mqttClient.setCallback(onMqttReceived);
    mqttClient.setBufferSize (4096);
}

void publishStateClosed(uint indexFrame, uint currFrame) {
    JsonDocument doc;
    char jsonBuffer[BUFFER_SIZE * 29];
    doc["r"] = arrayToString(rBuffer, indexFrame + 1);
    doc["u"] = arrayToString(uBuffer, indexFrame + 1);
    doc["y"] = arrayToString(yBuffer, indexFrame + 1);
    doc["frame"] = long2Hex(currFrame);
    serializeJson(doc, jsonBuffer); // print to client
    mqttClient.publish(SYS_USER_SIGNALS_CLOSED, jsonBuffer);
}

void publishStateOpen(uint indexFrame, uint currFrame) {
    JsonDocument doc;
    char jsonBuffer[BUFFER_SIZE * 21];
    doc["u"] = arrayToString(uBuffer, indexFrame+1);
    doc["y"] = arrayToString(yBuffer, indexFrame+1);
    doc["frame"] = long2Hex(currFrame);
    serializeJson(doc, jsonBuffer); // print to client
    mqttClient.publish(SYS_USER_SIGNALS_OPEN, jsonBuffer);
}

static void publishStateTask (void *pvParameters) {
    // local constants
    uint32_t rv;
    uint16_t  indexFrame;
    uint16_t currFrame;

    for (;;) {
        xTaskNotifyWait(0, 0b0011, &rv, portMAX_DELAY);
        if (rv & 0b0001) {
            if (np <= total_time) {
                indexFrame = np % BUFFER_SIZE;
                currFrame = np/BUFFER_SIZE + 1;
                rBuffer[indexFrame] = reference;
                uBuffer[indexFrame] = usat;
                yBuffer[indexFrame] = y;
                if (indexFrame == BUFFER_SIZE - 1) {
                    publishStateClosed(indexFrame, currFrame);
                  }
                else if (np == total_time) {
                    publishStateClosed(indexFrame, currFrame);
                  }

            }
        }
        else if  ( rv & 0b0010 ){
            if (np <= total_time) {
                indexFrame = np % BUFFER_SIZE;
                currFrame = np / BUFFER_SIZE + 1;
                uBuffer[indexFrame] = u;
                yBuffer[indexFrame] = y;
                if (indexFrame == BUFFER_SIZE - 1) {
                    publishStateOpen(indexFrame, currFrame);
                }
                else if (np == total_time) {
                    publishStateOpen(indexFrame, currFrame);
                }

