nebisman/UNDCMotor/code/esp32_code/src/main.cpp
            }

        }

    }
}

//float firFilter(float input) {
//    static float buffer[ORDER_FIR] = {0}; // Static buffer to store previous input samples
//    static int index = 0; // Index for circular buffer
//    float output = 0;
//
//    // Update buffer with the new input sample
//    buffer[index] = input;
//
//    // Apply the FIR filter
//    for (int i = 0; i < ORDER_FIR; i++) {
//        output += firCoeffs[i] * buffer[(index + ORDER_FIR - i) % ORDER_FIR];
//    }
//
//    // Update the buffer index for the next sample
//    index = (index + 1) % ORDER_FIR;
//    return output;
//}

float compDeadZone(float var, float offset, float zm){
    // This function compensates the dead zone of DC motor
    float udz;
    float sgnvar = abs(var)/var;
    if (abs(var) < zm){
        udz = 0;
        }
    else{
         udz = var + sgnvar* offset;
        }

    return udz;
}


void computeReference() {

    switch (codeTopic) {

        case DEFAULT_TOPIC:
            reference = encoderPot.getCount() * 4.5;
            displayLed(u, -5, 5, 0, 6);
            break;
        case USER_SYS_STEP_CLOSED_INT:
            if (np < points_low) {
                reference = low_val;
                // sending the indication for publishing
                xTaskNotify(h_publishStateTask, 0b0001, eSetBits);
                displayLed(y, low_val, high_val, 0.5, 6);
            }
            else if (np <= total_time) {
                reference = high_val;
                // sending the indication for publishing
                xTaskNotify(h_publishStateTask, 0b0001, eSetBits);
                displayLed(y, low_val, high_val, 0.5, 6);
            }
            else if (np == total_time + 1){
                printf("Closed loop step response completed\n");
                defaultControl();
            }
            break;

        case USER_SYS_STAIRS_CLOSED_INT:
            if (np <= total_time) {
                reference = stairs[np / duration];
                // sending the indication for publishing
                xTaskNotify(h_publishStateTask, 0b0001, eSetBits);
                displayLed(y, low_val, high_val, 0, 6);

            }
            else if (np == total_time + 1) {
                printf("Stairs closed loop response completed\n");
                defaultControl();
            }
            break;

        case USER_SYS_PROFILE_CLOSED_INT:
            if (np <= total_time) {
                reference = linearInterpolation(timeValues, stairs, points_stairs, np);
                displayLed(y, low_val, high_val, 0, 6);
                xTaskNotify(h_publishStateTask, 0b0001, eSetBits);
            }
            else if (np == total_time + 1) {
                printf("Closed loop profile response completed\n");
                defaultControl();
            }
            break;

    }
}





static void controlPidTask(void *pvParameters) {
    /* this function computes a two parameter PID control with Antiwindup
     See Astrom ans Murray
    */
    static bool led_status = false;
    const TickType_t taskPeriod = (pdMS_TO_TICKS(1000*h));

    float bi;      //scaled integral constant
    float ad;      //scale derivative constant 1
    float bd;      //scale derivative constant 2
    float P;       //  proportional action
    float D;       //  derivative action

    /** state variables for the PID */
    static float y_ant = 0;      //  past output
    static float I = 0;          // Integral action
//    float ef;

    for (;;) {
        TickType_t xLastWakeTime = xTaskGetTickCount();
        // at start we reset the integral action and the state variables
        // when receiving a new command
        if (reset_int) {
            np = 0;
            encoderMotor.clearCount();
            encoderPot.clearCount();
            reset_int = false;
            continue;
        }
        // reading the encoder
        y = encoderMotor.getCount() * pulses2degrees;
        // computing the current reference depending of the current command
        computeReference();
        // updating error

        /** updating controller parameters if they changed */
        // integral action scaled to sampling time
        bi = ki*h;
        // filtered derivative constant
        ad = kd/(N*(kd/N + h));
        bd = kd/(kd/N + h);
        P = kp*(beta * reference - y); // proportional actions
        D =  ad*D - bd*(y - y_ant); // derivative action
        u = P + I + D ; // control signal

        // Compensation of dead zone for the DC motor
        u  = compDeadZone(u, .35, 0.04);
        //saturated control signal
        usat = constrain(u, -5, 5);
        // sending the control signal to motor
        voltsToMotor(usat);
        // updating integral action
        I = I + bi *(reference - y) + br*(usat - u);
        // updating output
        y_ant = y;

        //The task is suspended while awaiting a new samplig time
        vTaskDelayUntil(&xLastWakeTime, taskPeriod);
        np +=1;
    }
}


float computeController(){
    /* This function computes a general controlller for the thermal system
       The controller is defined by the state equation
           x[n+1] = (A - L * C) * x[k] + (B - L * D) * [r[n] y[n]]^T + L *u[n]
       where A, B, C ,D are the state equation matrices and L is the observer's gain for antiwindup,
       r[n] and y[n] are, respectively, the current reference and the current temperature
       of the thermal system
    */

    static float X[10] = {0};
    float Xnew[10] = {0};
    static float control = 0;

    if (reset_int) {
        for (size_t  i = 0; i < order; i++){
            X[i] = 0;
        }
        control = 0;
        reset_int = false;
    }

    for (size_t i = 0; i < order; i++ ){
        for (size_t j = 0; j < order; j++ ){
            Xnew[i] +=  A[i][j] * X[j];
        }
        Xnew[i] +=  B[i][0]* reference + B[i][1] * y + L[i] * control;
    }
    control = D[0] * reference + D[1] * y;
    for (size_t i = 0; i < order; i++ ){
        control += C[i]*X[i];
    }
    for (size_t i = 0; i < order; i++ ){
        X[i] = Xnew[i];
    }
    control = constrain(control, -5,  5);
    return control;
}


static void generalControlTask(void *pvParameters) {
    //this pin is only for vizualizing the correct timing of the control routine
    // Set the sampling time for the task at h=0.02 ms
    const TickType_t taskPeriod = (pdMS_TO_TICKS(1000*h));


