nebisman/UNDCMotor/code/esp32_code/src/main.cpp
    for (;;) {
        TickType_t xLastWakeTime = xTaskGetTickCount();
        if (reset_int) {
            encoderMotor.clearCount();
            encoderPot.clearCount();
            np = 0;
        }
        // reading the encoder
        y = encoderMotor.getCount() * pulses2degrees;

        // computing the current reference depending of the current command
        computeReference();

        // computing the general controlled
        u = computeController();
        // Compensation of dead zone for the DC motor
        u  = compDeadZone(u, .35, 0.04);
        //saturated control signal
        usat = constrain(u, -5, 5);


        // sending the control signal to motor
        voltsToMotor(usat);
        //The task is suspended while awaiting a new sampling time
        vTaskDelayUntil(&xLastWakeTime, taskPeriod);
        np +=1;
    }
}




static void identifyTask(void *pvParameters) {
/*  This task involves identifying the DC motor using
 *  a PRBS signal stored in the prbsSignal array.
 *  */

const TickType_t taskPeriod = (uint32_t) (1000 * h);
    uint byteIndex = 0;
    uint bitShift;
    bool  currBit;

    for (;;) {
        TickType_t xLastWakeTime = xTaskGetTickCount();

        if (reset_int){
            voltsToMotor((low_val + high_val) / 2);
            vTaskDelay(pdMS_TO_TICKS(1000));
            reset_int = false;
            np = 0;
            encoderMotor.clearCount();
            vTaskDelay(pdMS_TO_TICKS(1000*h));
            continue;
        }

        if (np <= total_time) {
            y = encoderMotor.getCount() * pulses2degrees /h;
            encoderMotor.clearCount();
            byteIndex =  (np / (32 * divider));
            bitShift = 31 - ((np/divider) % 32);
            currBit = (pbrsSignal[byteIndex] >> bitShift) & 1;
            if (currBit) {
                u = high_val;
            } else {
                u = low_val;
            }
            voltsToMotor(u);
            xTaskNotify(h_publishStateTask, 0b0010, eSetBits);
            displayLed(u, low_val, high_val, 0.6, 6);

        }
        else if (np == total_time + 1) {
            voltsToMotor(0);
            printf("Open loop PBRS response completed\n");
            defaultControl();
        }
        vTaskDelayUntil(&xLastWakeTime, taskPeriod);
        np +=1;
    }
}



static void stepOpenTask(void *pvParameters) {
/*  This task returns the velocity step response
 *  of the  DC motor
 *  */
    const TickType_t taskPeriod = (uint32_t) (1000 * h);
    for (;;) {
        TickType_t xLastWakeTime = xTaskGetTickCount();
        if (reset_int){
            //this allow to set steady state for the low step
            voltsToMotor(low_val);
            vTaskDelay(pdMS_TO_TICKS(1000));
            reset_int = false;
            np = 0;
            encoderMotor.clearCount();
            vTaskDelay(pdMS_TO_TICKS(1000*h));
            continue;
        }
        //currPosition = encoderMotor.getCount() * pulses2degrees;
        y = encoderMotor.getCount() * pulses2degrees/ h;
        encoderMotor.clearCount();
        //lastPosition = currPosition;
        if (np < points_low) {
            u = low_val;
            voltsToMotor(u);
            xTaskNotify(h_publishStateTask, 0b0010, eSetBits);
        }
        else if (np <= total_time) {
            u  = high_val;
            voltsToMotor(u);
            xTaskNotify(h_publishStateTask, 0b0010, eSetBits);
        }
        else if (np == total_time + 1){
            voltsToMotor( 0);
            printf("Open loop step response completed\n");
            defaultControl();

        }
        vTaskDelayUntil(&xLastWakeTime, taskPeriod);
        np +=1;
    }
}


void setup() {
    //Setting the maximal priority for setup
    vTaskPrioritySet(nullptr,24);

    //setting the pwm channels
    ledcSetup(CH_PWM_AIN1  ,  FREQUENCY_PWM, RESOLUTION_PWM);
    ledcSetup(CH_PWM_AIN2  ,  FREQUENCY_PWM, RESOLUTION_PWM);
    ledcAttachPin(PIN_AIN1 , CH_PWM_AIN1);
    ledcAttachPin(PIN_AIN2 , CH_PWM_AIN2);

    //open the serial port for revising the borad messages
    Serial.begin(115200);
    //setting the encoders
    encoderMotor.attachFullQuad (CH_ENC_A, CH_ENC_B);
    encoderMotor.setCount(0);


   // Setting the potentiometer for setting reference

    pinMode(CH_ENC_A_POT , PULLUP);
    pinMode(CH_ENC_A_POT , PULLUP);
    encoderPot.attachFullQuad(CH_ENC_A_POT, CH_ENC_B_POT);
    encoderPot.setFilter(100);

   // setting rgb led
    dispLed.begin();
    dispLed.clear();
    dispLed.show();
    dispLed.setBrightness(127);

    //create the task for communication in core 1
    xTaskCreatePinnedToCore(
            publishStateTask, // This is communication task
            "User command IOT",
            8192,
            NULL,
            10,
            &h_publishStateTask,
            CORE_COMM
    );
    vTaskSuspend(h_publishStateTask);

    // Creating the task for PID control in core 0.
    xTaskCreatePinnedToCore(
            controlPidTask, // This is the control routine
            "PID control",
            8192,
            NULL,
            23,
            &h_controlPidTask,
            CORE_CONTROL
    );


    connectWiFi();
    initMqtt();
    connectMqtt();
    xTaskCreatePinnedToCore(
            handleConnections, // This is communication task
            "handle connections",
            4096,
            nullptr,
            10,
            nullptr,
            CORE_COMM // communications are attached to core 1
    );

    // Create the task for general control in core 0.
    xTaskCreatePinnedToCore(
            generalControlTask, // This is the control routine
            "general control",
            8192,
            NULL,
            23,
            &h_generalControlTask,
            CORE_CONTROL
    );
    vTaskSuspend(h_generalControlTask);

    xTaskCreatePinnedToCore(
            identifyTask,
            "prbs-ident",
            4096,
            NULL,
            20,
            &h_identifyTask,
            CORE_CONTROL
    );
    vTaskSuspend(h_identifyTask);

    xTaskCreatePinnedToCore(
            stepOpenTask,
            "step-open",
            4096,
            NULL,
            20,
            &h_stepOpenTask,
            CORE_CONTROL
    );
    vTaskSuspend(h_stepOpenTask);





}




void loop() {
    vTaskDelete(nullptr);

//    h = encoderPot.getCount();
//       printf("y= %0.2f\n    ref =%0.2f", y, reference);
//       vTaskDelay(500);
}